In [4]:
import numpy as np
import pandas as pd
import warnings

In [5]:
warnings.filterwarnings('ignore')

In [16]:
columns_name=["user_id","item_id","rating","timestamp"]
df=pd.read_csv('./ml-100k/ml-100k/u.data',sep='\t',names=columns_name)

In [17]:
df.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [18]:
df.shape

(100000, 4)

In [20]:
#to get the unique rows 
df["user_id"].nunique()

943

In [21]:
df["item_id"].nunique()

1682

In [37]:
movies_titles=pd.read_csv('./ml-100k/ml-100k/u.item', sep='|', encoding='latin-1',header=None)
movies_titles=movies_titles[[0,1]]
movies_titles.columns=['item_id','title']
movies_titles

      item_id                                      title
0           1                           Toy Story (1995)
1           2                           GoldenEye (1995)
2           3                          Four Rooms (1995)
3           4                          Get Shorty (1995)
4           5                             Copycat (1995)
...       ...                                        ...
1677     1678                          Mat' i syn (1997)
1678     1679                           B. Monkey (1998)
1679     1680                       Sliding Doors (1998)
1680     1681                        You So Crazy (1994)
1681     1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [39]:
df=pd.merge(df,movies_titles,on="item_id")
df.tail()

,user_id,item_id,rating,timestamp,title_x,title_y
99995,840,1674,4,891211682,Mamma Roma (1962),Mamma Roma (1962)
99996,655,1640,3,888474646,"Eighth Day, The (1996)","Eighth Day, The (1996)"
99997,655,1637,3,888984255,Girls Town (1996),Girls Town (1996)
99998,655,1630,3,887428735,"Silence of the Palace, The (Saimt el Qusur) (1...","Silence of the Palace, The (Saimt el Qusur) (1..."
99999,655,1641,3,887427810,Dadetown (1995),Dadetown (1995)